using Domain.Base;
using Domain.Entities;

namespace Infrastructure.PersistenceMemory
{
    // این کلاس پراپرتی های داره که در دامین درست شده اند 
    public class DataContext
    {
        // استاتیک ها نمونه نمیسازن از خود اطالاعات وارد شده استفاده میکنن
        // ماهم اطالاعات داخل دامین رو میخوایم پس باید این کلاس استاتیک باشه 

        public List<Product> Products { get; set; } = new List<Product>() { new Product("book", new Money(10000)) };
        public List<Order> Orders { get; set; } = new List<Order>() { new Order(1) };

        // Persistence.memory به معنی ذخیره سازی داده ها در حافظه است.این نوع ذخیره سازی معمولاً برای داده هایی استفاده می شود که نیاز به دسترسی سریع و مکرر دارند. برای مثال، اگر یک برنامه نیاز به دسترسی مکرر به یک مجموعه از داده ها دارد، ممکن است این داده ها را در حافظه ذخیره کند تا به جای بازخوانی آنها از پایگاه داده در هر بار، بتواند به آنها به صورت سریعتر دسترسی پیدا کند.البته، این نوع ذخیره سازی فقط برای داده های موقت مناسب است و در صورت قطع برق یا ریست شدن سیستم، این داده ها از بین خواهند رفت.بنابراین، باید از رو


    }
}
