namespace Domain;

public interface IDomainService
{
    // برای بررسی کردن این‌که محصول وجود دارد یا نه 
    bool IsProductExist(long ProductId);

    /*
    امین سرویس مربوط به اگریگیت هامونه
    زمان هایی که یکسری اطلاعات رو باید به اگریگیت ها ادد بکنیم نه روت ها این زمان از سرویس ها استفاده میکنیم
    دامین سرویس ها اطلاعات رو پردازش میکنن و برش میگردونن
    اما چیزی رو نباید تغییر بدن
    به صورت خلاصه
    زمانی استفاده میشه که به اطلاعات اگریگیت هایی دیگه نیاز داشته باشیم
    اگر در لایه های core (دامیت و اپلیکیشن) و دامین قابل پیاده سازی بود که پیاده سازیش میکنیم
    اما اگر قابل پیاده سازی نبود تو اینفراستراکچر پیاده سازیش میکنیم
    */
}
